## Staging Plan
#### SHA: `1994e4e54a9d6c8e32f7d72490e9f7eccf94ce9f`
#### PR: `1`

#### ⚙️  Initialize `success`
#### 🗄️ Workspace ``   
#### 📖 Plan `success`

<details><summary>Show Plan</summary>

```

module.postbuild_pointy.aws_iam_role.lambda_exec: Refreshing state... [id=-pointy-lambda_execution_role]
module.postbuild_pointy.aws_acm_certificate.www_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/bd717904-4407-49ce-a2b9-4cff4411a61b]
module.postbuild_pointy.aws_acm_certificate.app_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/1472e0e6-f850-44d4-8aa1-d4a4ab90bc66]
module.postbuild.aws_ecs_cluster.default: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:cluster/reviso]
module.postbuild.aws_acm_certificate.app_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/9ec05a10-509a-436a-861b-76248105375f]
module.postbuild.aws_sns_topic.ecs_alerts: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts]
module.postbuild.aws_iam_role.lambda_exec: Refreshing state... [id=-reviso-lambda_execution_role]
module.postbuild.aws_acm_certificate.www_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/604ab9c8-59d1-4694-94af-936f2368948f]
module.postbuild.aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::533267310428:policy/-reviso-lambda_sns_policy]
module.postbuild_pointy.aws_sns_topic.ecs_alerts: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts]
module.postbuild_pointy.aws_ecs_cluster.default: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:cluster/pointy]
module.postbuild_pointy.aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::533267310428:policy/-pointy-lambda_sns_policy]
module.postbuild_pointy.aws_lambda_function.ecs_alerts: Refreshing state... [id=-pointy-ECSCPUAlerts]
module.postbuild.aws_lambda_function.ecs_alerts: Refreshing state... [id=-reviso-ECSCPUAlerts]
module.postbuild.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=-reviso-lambda_execution_role-20250220220734660800000002]
module.postbuild_pointy.aws_ecs_task_definition.server: Refreshing state... [id=pointy-server]
module.postbuild_pointy.aws_lb.web_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-web-alb/4a61b96ac7b3592d]
module.postbuild_pointy.aws_lb.app_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-app-alb/22245f02fa9f475a]
module.postbuild.aws_lb.app_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-app-alb/32f088b5d021d3df]
module.postbuild.aws_lb.web_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-web-alb/8fafc791aca8c444]
module.postbuild.aws_ecs_task_definition.server: Refreshing state... [id=reviso-server]
module.postbuild_pointy.aws_lb_target_group.web_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-web-tg/4f5579b8a35681f2]
module.postbuild_pointy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=-pointy-lambda_execution_role-20250220220734220800000001]
module.postbuild_pointy.aws_lb_target_group.server_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-server-tg/8883e71f215b1894]
module.postbuild_pointy.aws_ecs_task_definition.web: Refreshing state... [id=pointy-web]
module.postbuild.aws_route53_record.www_cert_validation["www.reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz._CNAME]
module.postbuild.aws_route53_record.app_cert_validation["app.reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz._CNAME]
module.postbuild_pointy.aws_route53_record.app_cert_validation["app.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__b6e4ae139628a416e254bc5d74611182.app.test.pointy.ai._CNAME]
module.postbuild_pointy.aws_route53_record.www_cert_validation["www.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__bbc58cc88f1bbef5f1672734bb3e3b31.www.test.pointy.ai._CNAME]
module.postbuild.aws_lb_target_group.web_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-web-tg/35ee97feb2e64330]
module.postbuild.aws_lb_target_group.server_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-server-tg/4ac516f4c27de26f]
module.postbuild.aws_acm_certificate_validation.www_cert_validation: Refreshing state... [id=2024-02-16 16:37:46.279 +0000 UTC]
module.postbuild.aws_ecs_task_definition.web: Refreshing state... [id=reviso-web]
module.postbuild.aws_acm_certificate_validation.app_cert_validation: Refreshing state... [id=2024-06-27 16:03:16.248 +0000 UTC]
module.postbuild_pointy.aws_sns_topic_subscription.lambda_subscription: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts:05f03a16-b101-43dd-a6e3-10619c7d49d8]
module.postbuild_pointy.aws_lambda_permission.allow_sns_to_call_lambda: Refreshing state... [id=AllowExecutionFromSNS]
module.postbuild.aws_sns_topic_subscription.lambda_subscription: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts:a42eb9d9-1428-4533-81b7-31df1348861b]
module.postbuild_pointy.aws_acm_certificate_validation.app_cert_validation: Refreshing state... [id=2025-02-20 20:13:55.824 +0000 UTC]
module.postbuild.aws_lambda_permission.allow_sns_to_call_lambda: Refreshing state... [id=AllowExecutionFromSNS]
module.postbuild_pointy.aws_acm_certificate_validation.www_cert_validation: Refreshing state... [id=2025-02-20 20:13:52.975 +0000 UTC]
module.postbuild.aws_route53_record.app: Refreshing state... [id=Z0893527DM29OSHJP7NG_app.reviso.biz_A]
module.postbuild.aws_lb_listener.server_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/4c05718cd6c3d377]
module.postbuild_pointy.aws_lb_listener.www_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/60cb3ee4f67bd714]
module.postbuild_pointy.aws_route53_record.www: Refreshing state... [id=Z036564521TUMO3XKOL1V_www.test.pointy.ai_A]
module.postbuild_pointy.aws_lb_listener.server_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/f739ca38124d6010]
module.postbuild_pointy.aws_route53_record.app: Refreshing state... [id=Z036564521TUMO3XKOL1V_app.test.pointy.ai_A]
module.postbuild.aws_route53_record.www: Refreshing state... [id=Z0893527DM29OSHJP7NG_www.reviso.biz_A]
module.postbuild.aws_lb_listener.www_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/82dfd4a9b5f495c0]
module.postbuild.aws_lb_listener.web_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/374846968819bd56]
module.postbuild.aws_lb_listener.server_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/cefe91f8e917162b]
module.postbuild_pointy.aws_lb_listener.server_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/e65c2cb7718cd08b]
module.postbuild_pointy.aws_lb_listener.web_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/08b88ea108aaf6ae]
module.postbuild.aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-web]
module.postbuild.aws_ecs_service.server: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-server]
module.postbuild_pointy.aws_ecs_service.server: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server]
module.postbuild_pointy.aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web]
module.postbuild.aws_cloudwatch_metric_alarm.health_check_failures: Refreshing state... [id=-reviso-health-check-failures]
module.postbuild.aws_cloudwatch_metric_alarm.low_cpu_utilization: Refreshing state... [id=-reviso-low-cpu-utilization]
module.postbuild.aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=-reviso-high-cpu-utilization]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.health_check_failures: Refreshing state... [id=-pointy-health-check-failures]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.low_cpu_utilization: Refreshing state... [id=-pointy-low-cpu-utilization]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=-pointy-high-cpu-utilization]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.postbuild.aws_ecs_task_definition.server has been changed
  ~ resource "aws_ecs_task_definition" "server" {
        id                       = "reviso-server"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild.aws_ecs_task_definition.web has been changed
  ~ resource "aws_ecs_task_definition" "web" {
        id                       = "reviso-web"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild_pointy.aws_ecs_task_definition.server has been changed
  ~ resource "aws_ecs_task_definition" "server" {
        id                       = "pointy-server"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild_pointy.aws_ecs_task_definition.web has been changed
  ~ resource "aws_ecs_task_definition" "web" {
        id                       = "pointy-web"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.postbuild.aws_ecs_service.server will be updated in-place
  ~ resource "aws_ecs_service" "server" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-server"
        name                               = "reviso-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server:646" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild.aws_ecs_service.web will be updated in-place
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-web"
        name                               = "reviso-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-web:636" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild.aws_ecs_task_definition.server must be replaced
-/+ resource "aws_ecs_task_definition" "server" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server:646" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - systemControls        = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/reviso-server:13abd57268ba05f9faa4c1b2b87e4e9f4d99f30d" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/reviso-server:1994e4e54a9d6c8e32f7d72490e9f7eccf94ce9f"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "reviso-server" -> (known after apply)
      ~ revision                 = 646 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postbuild.aws_ecs_task_definition.web must be replaced
-/+ resource "aws_ecs_task_definition" "web" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-web:636" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/reviso-web:13abd57268ba05f9faa4c1b2b87e4e9f4d99f30d" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/reviso-web:1994e4e54a9d6c8e32f7d72490e9f7eccf94ce9f"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "reviso-web" -> (known after apply)
      ~ revision                 = 636 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postbuild.aws_lambda_function.ecs_alerts will be updated in-place
  ~ resource "aws_lambda_function" "ecs_alerts" {
        id                             = "-reviso-ECSCPUAlerts"
        tags                           = {}
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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" -> "https://hooks.slack.com/services/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"
            }
        }



        # (3 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_service.server will be updated in-place
  ~ resource "aws_ecs_service" "server" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server"
        name                               = "pointy-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:5" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_service.web will be updated in-place
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web"
        name                               = "pointy-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:5" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.server must be replaced
-/+ resource "aws_ecs_task_definition" "server" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - systemControls        = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:13abd57268ba05f9faa4c1b2b87e4e9f4d99f30d" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:1994e4e54a9d6c8e32f7d72490e9f7eccf94ce9f"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-server" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.web must be replaced
-/+ resource "aws_ecs_task_definition" "web" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:13abd57268ba05f9faa4c1b2b87e4e9f4d99f30d" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:1994e4e54a9d6c8e32f7d72490e9f7eccf94ce9f"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-web" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postbuild_pointy.aws_lambda_function.ecs_alerts will be updated in-place
  ~ resource "aws_lambda_function" "ecs_alerts" {
        id                             = "-pointy-ECSCPUAlerts"
        tags                           = {}
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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" -> "https://hooks.slack.com/services/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"
            }
        }



        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.

Changes to Outputs:
  ~ ecs_deployment_task_definition        = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server:646" -> (known after apply)
  ~ pointy_ecs_deployment_task_definition = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:5" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```

</details>

*Pushed by: @fivetentaylor, Action: `pull_request`*